ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p55x_adc_regs.xml
	<register id="ADCSOCOVFCLR1" width="16" page="1" offset="0x18" internal="0" description="ADC SOC Overflow Clear 1 Register">
		<bitfield id="SOC0" description="SOC0 Clear Start of Conversion Overflow Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOC1" description="SOC1 Clear Start of Conversion Overflow Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOC2" description="SOC2 Clear Start of Conversion Overflow Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOC3" description="SOC3 Clear Start of Conversion Overflow Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOC4" description="SOC4 Clear Start of Conversion Overflow Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOC5" description="SOC5 Clear Start of Conversion Overflow Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOC6" description="SOC6 Clear Start of Conversion Overflow Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOC7" description="SOC7 Clear Start of Conversion Overflow Bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SOC8" description="SOC8 Clear Start of Conversion Overflow Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SOC9" description="SOC9 Clear Start of Conversion Overflow Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SOC10" description="SOC10 Clear Start of Conversion Overflow Bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SOC11" description="SOC11 Clear Start of Conversion Overflow Bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOC12" description="SOC12 Clear Start of Conversion Overflow Bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SOC13" description="SOC13 Clear Start of Conversion Overflow Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SOC14" description="SOC14 Clear Start of Conversion Overflow Bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SOC15" description="SOC15 Clear Start of Conversion Overflow Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOC0CTL" width="32" page="1" offset="0x1a" internal="0" description="ADC SOC0 Control Register">
		<bitfield id="ACQPS" description="SOC0 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC0 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC0 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC0 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC0 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC1CTL" width="32" page="1" offset="0x1c" internal="0" description="ADC SOC1 Control Register">
		<bitfield id="ACQPS" description="SOC1 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC1 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC1 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC1 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC1 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC2CTL" width="32" page="1" offset="0x1e" internal="0" description="ADC SOC2 Control Register">
		<bitfield id="ACQPS" description="SOC2 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC2 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC2 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC2 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC2 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC3CTL" width="32" page="1" offset="0x20" internal="0" description="ADC SOC3 Control Register">
		<bitfield id="ACQPS" description="SOC3 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC3 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC3 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC3 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC3 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC4CTL" width="32" page="1" offset="0x22" internal="0" description="ADC SOC4 Control Register">
		<bitfield id="ACQPS" description="SOC4 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC4 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC4 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC4 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC4 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC5CTL" width="32" page="1" offset="0x24" internal="0" description="ADC SOC5 Control Register">
		<bitfield id="ACQPS" description="SOC5 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC5 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC5 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC5 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC5 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC6CTL" width="32" page="1" offset="0x26" internal="0" description="ADC SOC6 Control Register">
		<bitfield id="ACQPS" description="SOC6 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC6 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC6 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC6 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC6 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
