ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p55x_adc_regs.xml
	<register id="ADCSOC7CTL" width="32" page="1" offset="0x28" internal="0" description="ADC SOC7 Control Register">
		<bitfield id="ACQPS" description="SOC7 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC7 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC7 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC7 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC7 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC8CTL" width="32" page="1" offset="0x2a" internal="0" description="ADC SOC8 Control Register">
		<bitfield id="ACQPS" description="SOC8 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC8 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC8 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC8 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC8 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC9CTL" width="32" page="1" offset="0x2c" internal="0" description="ADC SOC9 Control Register">
		<bitfield id="ACQPS" description="SOC9 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC9 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC9 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC9 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC9 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC10CTL" width="32" page="1" offset="0x2e" internal="0" description="ADC SOC10 Control Register">
		<bitfield id="ACQPS" description="SOC10 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC10 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC10 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC10 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC10 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC11CTL" width="32" page="1" offset="0x30" internal="0" description="ADC SOC11 Control Register">
		<bitfield id="ACQPS" description="SOC11 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC11 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC11 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC11 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC11 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC12CTL" width="32" page="1" offset="0x32" internal="0" description="ADC SOC12 Control Register">
		<bitfield id="ACQPS" description="SOC12 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC12 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC12 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC12 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC12 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC13CTL" width="32" page="1" offset="0x34" internal="0" description="ADC SOC13 Control Register">
		<bitfield id="ACQPS" description="SOC13 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC13 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC13 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC13 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC13 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC14CTL" width="32" page="1" offset="0x36" internal="0" description="ADC SOC14 Control Register">
		<bitfield id="ACQPS" description="SOC14 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC14 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC14 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC14 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC14 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC15CTL" width="32" page="1" offset="0x38" internal="0" description="ADC SOC15 Control Register">
		<bitfield id="ACQPS" description="SOC15 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="SAMPCAPRESETSEL" description="SOC15 Sample Cap Reset Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC15 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC15 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC15 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCEVTSTAT" width="16" page="1" offset="0x5a" internal="0" description="ADC Event Status Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Flag" begin="14" end="14" width="1" rwaccess="R"/>
	</register>
