ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p55x_adc_regs.xml
	<register id="ADCPPB1STAMP" width="16" page="1" offset="0x6b" internal="0" description="ADC PPB1 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block 1 Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB1OFFCAL" width="16" page="1" offset="0x6c" internal="0" description="ADC PPB1 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1OFFREF" width="16" page="1" offset="0x6d" internal="0" description="ADC PPB1 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block 1 Offset Reference" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1TRIPHI" width="32" page="1" offset="0x6e" internal="0" description="ADC PPB1 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block 1 Trip High Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1TRIPLO" width="32" page="1" offset="0x70" internal="0" description="ADC PPB1 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 1 Trip Low Limit" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LIMITLO2EN" description="Extended Low Limit 2 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block 1 Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPBTRIP1FILCTL" width="16" page="1" offset="0x72" internal="0" description="ADCEVT1 Trip High Filter Control Register">
		<bitfield id="FILTHIEN" description="ADCPPB1 TRIPHI Filter Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FILTLOEN" description="ADCPPB1 TRIPLO Filter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="3" width="6" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="14" end="9" width="6" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPBTRIP1FILCLKCTL" width="32" page="1" offset="0x74" internal="0" description="ADCEVT1 Trip High Filter Prescale Control Register">
		<bitfield id="CLKPRESCALE" description="Filter Clock Prescale" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2CONFIG" width="16" page="1" offset="0x7a" internal="0" description="ADC PPB{#} Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block 2 Configuration" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CBCEN" description="Cycle By Cycle Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ABSEN" description="ADC Post Processing Block 2 Absolute Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 2 Two's Complement Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DELTAEN" description="ADC Post Processing Block 2 Last Sample Delta Enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2STAMP" width="16" page="1" offset="0x7b" internal="0" description="ADC PPB2 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block 2 Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB2OFFCAL" width="16" page="1" offset="0x7c" internal="0" description="ADC PPB2 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2OFFREF" width="16" page="1" offset="0x7d" internal="0" description="ADC PPB2 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block 2 Offset Reference" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2TRIPHI" width="32" page="1" offset="0x7e" internal="0" description="ADC PPB2 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block 2 Trip High Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2TRIPLO" width="32" page="1" offset="0x80" internal="0" description="ADC PPB2 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 2 Trip Low Limit" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LIMITLO2EN" description="Extended Low Limit 2 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block 2 Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPBTRIP2FILCTL" width="16" page="1" offset="0x82" internal="0" description="ADCEVT2 Trip High Filter Control Register">
		<bitfield id="FILTHIEN" description="ADCPPB2 TRIPHI Filter Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FILTLOEN" description="ADCPPB2 TRIPLO Filter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="3" width="6" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="14" end="9" width="6" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPBTRIP2FILCLKCTL" width="32" page="1" offset="0x84" internal="0" description="ADCEVT2 Trip High Filter Prescale Control Register">
		<bitfield id="CLKPRESCALE" description="Filter Clock Prescale" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3CONFIG" width="16" page="1" offset="0x8a" internal="0" description="ADC PPB{#} Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block 3 Configuration" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CBCEN" description="Cycle By Cycle Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ABSEN" description="ADC Post Processing Block 3 Absolute Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 3 Two's Complement Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DELTAEN" description="ADC Post Processing Block 3 Last Sample Delta Enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3STAMP" width="16" page="1" offset="0x8b" internal="0" description="ADC PPB3 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block 3 Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB3OFFCAL" width="16" page="1" offset="0x8c" internal="0" description="ADC PPB3 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3OFFREF" width="16" page="1" offset="0x8d" internal="0" description="ADC PPB3 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block 3 Offset Reference" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3TRIPHI" width="32" page="1" offset="0x8e" internal="0" description="ADC PPB3 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block 3 Trip High Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3TRIPLO" width="32" page="1" offset="0x90" internal="0" description="ADC PPB3 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 3 Trip Low Limit" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LIMITLO2EN" description="Extended Low Limit 2 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block 3 Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPBTRIP3FILCTL" width="16" page="1" offset="0x92" internal="0" description="ADCEVT3 Trip High Filter Control Register">
		<bitfield id="FILTHIEN" description="ADCPPB3 TRIPHI Filter Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FILTLOEN" description="ADCPPB3 TRIPLO Filter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="3" width="6" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="14" end="9" width="6" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPBTRIP3FILCLKCTL" width="32" page="1" offset="0x94" internal="0" description="ADCEVT3 Trip High Filter Prescale Control Register">
		<bitfield id="CLKPRESCALE" description="Filter Clock Prescale" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
