ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p55x_adc_regs.xml
	<register id="ADCPPBP1PCOUNT" width="16" page="1" offset="0xec" internal="0" description="ADC PPB1 Partial Conversion Count Register">
		<bitfield id="PCOUNT" description="Post Processing Block 1 Partial Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB1CONFIG2" width="16" page="1" offset="0xee" internal="0" description="ADC PPB1 Sum Shift Register">
		<bitfield id="SHIFT" description="Post Processing Block 1 Right Shift" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="Post Processing Block 1 Sync. Input Select" begin="9" end="4" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="Post Processing Block 1 Software Force Sync. " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OSINTSEL" description="Post Processing Block 1 Interrupt Source Select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="COMPSEL" description="Post Processing Block 1 Compare Source Select" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1PSUM" width="32" page="1" offset="0xf0" internal="0" description="ADC PPB1 Partial Sum Register">
		<bitfield id="PSUM" description="Post Processing Block 1 Oversampling Partial Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB1PMAX" width="32" page="1" offset="0xf2" internal="0" description="ADC PPB1 Partial Max Register">
		<bitfield id="PMAX" description="Post Processing Block 1 Oversampling Partial Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB1PMAXI" width="16" page="1" offset="0xf4" internal="0" description="ADC PPB1 Partial Max Index Register">
		<bitfield id="PMAXI" description="Post Processing Block 1 Oversampling Partial Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB1PMIN" width="32" page="1" offset="0xf6" internal="0" description="ADC PPB1 Partial MIN Register">
		<bitfield id="PMIN" description="Post Processing Block 1 Oversampling Partial Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB1PMINI" width="16" page="1" offset="0xf8" internal="0" description="ADC PPB1 Partial Min Index Register">
		<bitfield id="PMINI" description="Post Processing Block 1 Oversampling Partial Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB1TRIPLO2" width="32" page="1" offset="0xfa" internal="0" description="ADC PPB1 Extended Trip Low Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 1 Trip Low Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2LIMIT" width="16" page="1" offset="0x104" internal="0" description="ADC PPB2Conversion Count Limit Register">
		<bitfield id="LIMIT" description="Post Processing Block 2 Limit" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPBP2PCOUNT" width="16" page="1" offset="0x106" internal="0" description="ADC PPB2 Partial Conversion Count Register">
		<bitfield id="PCOUNT" description="Post Processing Block 2 Partial Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2CONFIG2" width="16" page="1" offset="0x108" internal="0" description="ADC PPB2 Sum Shift Register">
		<bitfield id="SHIFT" description="Post Processing Block 2 Right Shift" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="Post Processing Block 2 Sync. Input Select" begin="9" end="4" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="Post Processing Block 2 Software Force Sync. " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OSINTSEL" description="Post Processing Block 2 Interrupt Source Select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="COMPSEL" description="Post Processing Block 2 Compare Source Select" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2PSUM" width="32" page="1" offset="0x10a" internal="0" description="ADC PPB2 Partial Sum Register">
		<bitfield id="PSUM" description="Post Processing Block 2 Oversampling Partial Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB2PMAX" width="32" page="1" offset="0x10c" internal="0" description="ADC PPB2 Partial Max Register">
		<bitfield id="PMAX" description="Post Processing Block 2 Oversampling Partial Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB2PMAXI" width="16" page="1" offset="0x10e" internal="0" description="ADC PPB2 Partial Max Index Register">
		<bitfield id="PMAXI" description="Post Processing Block 2 Oversampling Partial Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2PMIN" width="32" page="1" offset="0x110" internal="0" description="ADC PPB2 Partial MIN Register">
		<bitfield id="PMIN" description="Post Processing Block 2 Oversampling Partial Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB2PMINI" width="16" page="1" offset="0x112" internal="0" description="ADC PPB2 Partial Min Index Register">
		<bitfield id="PMINI" description="Post Processing Block 2 Oversampling Partial Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2TRIPLO2" width="32" page="1" offset="0x114" internal="0" description="ADC PPB2 Extended Trip Low Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 2 Trip Low Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3LIMIT" width="16" page="1" offset="0x11e" internal="0" description="ADC PPB3Conversion Count Limit Register">
		<bitfield id="LIMIT" description="Post Processing Block 3 Limit" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPBP3PCOUNT" width="16" page="1" offset="0x120" internal="0" description="ADC PPB3 Partial Conversion Count Register">
		<bitfield id="PCOUNT" description="Post Processing Block 3 Partial Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
